tests/fixtures/invoice.json

 {
    "id": "1b82356d-b5fd-46f8-bde9-3680d62f289a",
    "status": "initiated",
    "amount": "1000",
    "currency": "SAR",
    "description": "Test",
    "logo_url": "https://s3-eu-west-1.amazonaws.com/moyasar.api.assets.prod/entities/logos/ec8/299/59-/original/data?1471819842",
    "amount_format": "10.00 SAR",
    "url": "https://dashboard.moyasar.com/invoices/1b82356d-b5fd-46f8-bde9-3680d62f289a",
    "created_at": "2016-10-15T14:23:49.587Z",
    "updated_at": "2016-10-15T14:23:49.587Z",
    "payments": []
  }

